###################################################################

# Created by write_sdc on Wed Feb 10 16:41:50 2021

###################################################################
set sdc_version 2.1

set_units -time ns -resistance MOhm -capacitance fF -voltage V -current mA
set_load -pin_load 3.40189 [get_ports {IM_ADDRESS[63]}]
set_load -pin_load 3.40189 [get_ports {IM_ADDRESS[62]}]
set_load -pin_load 3.40189 [get_ports {IM_ADDRESS[61]}]
set_load -pin_load 3.40189 [get_ports {IM_ADDRESS[60]}]
set_load -pin_load 3.40189 [get_ports {IM_ADDRESS[59]}]
set_load -pin_load 3.40189 [get_ports {IM_ADDRESS[58]}]
set_load -pin_load 3.40189 [get_ports {IM_ADDRESS[57]}]
set_load -pin_load 3.40189 [get_ports {IM_ADDRESS[56]}]
set_load -pin_load 3.40189 [get_ports {IM_ADDRESS[55]}]
set_load -pin_load 3.40189 [get_ports {IM_ADDRESS[54]}]
set_load -pin_load 3.40189 [get_ports {IM_ADDRESS[53]}]
set_load -pin_load 3.40189 [get_ports {IM_ADDRESS[52]}]
set_load -pin_load 3.40189 [get_ports {IM_ADDRESS[51]}]
set_load -pin_load 3.40189 [get_ports {IM_ADDRESS[50]}]
set_load -pin_load 3.40189 [get_ports {IM_ADDRESS[49]}]
set_load -pin_load 3.40189 [get_ports {IM_ADDRESS[48]}]
set_load -pin_load 3.40189 [get_ports {IM_ADDRESS[47]}]
set_load -pin_load 3.40189 [get_ports {IM_ADDRESS[46]}]
set_load -pin_load 3.40189 [get_ports {IM_ADDRESS[45]}]
set_load -pin_load 3.40189 [get_ports {IM_ADDRESS[44]}]
set_load -pin_load 3.40189 [get_ports {IM_ADDRESS[43]}]
set_load -pin_load 3.40189 [get_ports {IM_ADDRESS[42]}]
set_load -pin_load 3.40189 [get_ports {IM_ADDRESS[41]}]
set_load -pin_load 3.40189 [get_ports {IM_ADDRESS[40]}]
set_load -pin_load 3.40189 [get_ports {IM_ADDRESS[39]}]
set_load -pin_load 3.40189 [get_ports {IM_ADDRESS[38]}]
set_load -pin_load 3.40189 [get_ports {IM_ADDRESS[37]}]
set_load -pin_load 3.40189 [get_ports {IM_ADDRESS[36]}]
set_load -pin_load 3.40189 [get_ports {IM_ADDRESS[35]}]
set_load -pin_load 3.40189 [get_ports {IM_ADDRESS[34]}]
set_load -pin_load 3.40189 [get_ports {IM_ADDRESS[33]}]
set_load -pin_load 3.40189 [get_ports {IM_ADDRESS[32]}]
set_load -pin_load 3.40189 [get_ports {IM_ADDRESS[31]}]
set_load -pin_load 3.40189 [get_ports {IM_ADDRESS[30]}]
set_load -pin_load 3.40189 [get_ports {IM_ADDRESS[29]}]
set_load -pin_load 3.40189 [get_ports {IM_ADDRESS[28]}]
set_load -pin_load 3.40189 [get_ports {IM_ADDRESS[27]}]
set_load -pin_load 3.40189 [get_ports {IM_ADDRESS[26]}]
set_load -pin_load 3.40189 [get_ports {IM_ADDRESS[25]}]
set_load -pin_load 3.40189 [get_ports {IM_ADDRESS[24]}]
set_load -pin_load 3.40189 [get_ports {IM_ADDRESS[23]}]
set_load -pin_load 3.40189 [get_ports {IM_ADDRESS[22]}]
set_load -pin_load 3.40189 [get_ports {IM_ADDRESS[21]}]
set_load -pin_load 3.40189 [get_ports {IM_ADDRESS[20]}]
set_load -pin_load 3.40189 [get_ports {IM_ADDRESS[19]}]
set_load -pin_load 3.40189 [get_ports {IM_ADDRESS[18]}]
set_load -pin_load 3.40189 [get_ports {IM_ADDRESS[17]}]
set_load -pin_load 3.40189 [get_ports {IM_ADDRESS[16]}]
set_load -pin_load 3.40189 [get_ports {IM_ADDRESS[15]}]
set_load -pin_load 3.40189 [get_ports {IM_ADDRESS[14]}]
set_load -pin_load 3.40189 [get_ports {IM_ADDRESS[13]}]
set_load -pin_load 3.40189 [get_ports {IM_ADDRESS[12]}]
set_load -pin_load 3.40189 [get_ports {IM_ADDRESS[11]}]
set_load -pin_load 3.40189 [get_ports {IM_ADDRESS[10]}]
set_load -pin_load 3.40189 [get_ports {IM_ADDRESS[9]}]
set_load -pin_load 3.40189 [get_ports {IM_ADDRESS[8]}]
set_load -pin_load 3.40189 [get_ports {IM_ADDRESS[7]}]
set_load -pin_load 3.40189 [get_ports {IM_ADDRESS[6]}]
set_load -pin_load 3.40189 [get_ports {IM_ADDRESS[5]}]
set_load -pin_load 3.40189 [get_ports {IM_ADDRESS[4]}]
set_load -pin_load 3.40189 [get_ports {IM_ADDRESS[3]}]
set_load -pin_load 3.40189 [get_ports {IM_ADDRESS[2]}]
set_load -pin_load 3.40189 [get_ports {IM_ADDRESS[1]}]
set_load -pin_load 3.40189 [get_ports {IM_ADDRESS[0]}]
set_load -pin_load 3.40189 [get_ports MEMWRITE_OUT]
set_load -pin_load 3.40189 [get_ports MEMREAD_OUT]
set_load -pin_load 3.40189 [get_ports {DM_ADDRESS[63]}]
set_load -pin_load 3.40189 [get_ports {DM_ADDRESS[62]}]
set_load -pin_load 3.40189 [get_ports {DM_ADDRESS[61]}]
set_load -pin_load 3.40189 [get_ports {DM_ADDRESS[60]}]
set_load -pin_load 3.40189 [get_ports {DM_ADDRESS[59]}]
set_load -pin_load 3.40189 [get_ports {DM_ADDRESS[58]}]
set_load -pin_load 3.40189 [get_ports {DM_ADDRESS[57]}]
set_load -pin_load 3.40189 [get_ports {DM_ADDRESS[56]}]
set_load -pin_load 3.40189 [get_ports {DM_ADDRESS[55]}]
set_load -pin_load 3.40189 [get_ports {DM_ADDRESS[54]}]
set_load -pin_load 3.40189 [get_ports {DM_ADDRESS[53]}]
set_load -pin_load 3.40189 [get_ports {DM_ADDRESS[52]}]
set_load -pin_load 3.40189 [get_ports {DM_ADDRESS[51]}]
set_load -pin_load 3.40189 [get_ports {DM_ADDRESS[50]}]
set_load -pin_load 3.40189 [get_ports {DM_ADDRESS[49]}]
set_load -pin_load 3.40189 [get_ports {DM_ADDRESS[48]}]
set_load -pin_load 3.40189 [get_ports {DM_ADDRESS[47]}]
set_load -pin_load 3.40189 [get_ports {DM_ADDRESS[46]}]
set_load -pin_load 3.40189 [get_ports {DM_ADDRESS[45]}]
set_load -pin_load 3.40189 [get_ports {DM_ADDRESS[44]}]
set_load -pin_load 3.40189 [get_ports {DM_ADDRESS[43]}]
set_load -pin_load 3.40189 [get_ports {DM_ADDRESS[42]}]
set_load -pin_load 3.40189 [get_ports {DM_ADDRESS[41]}]
set_load -pin_load 3.40189 [get_ports {DM_ADDRESS[40]}]
set_load -pin_load 3.40189 [get_ports {DM_ADDRESS[39]}]
set_load -pin_load 3.40189 [get_ports {DM_ADDRESS[38]}]
set_load -pin_load 3.40189 [get_ports {DM_ADDRESS[37]}]
set_load -pin_load 3.40189 [get_ports {DM_ADDRESS[36]}]
set_load -pin_load 3.40189 [get_ports {DM_ADDRESS[35]}]
set_load -pin_load 3.40189 [get_ports {DM_ADDRESS[34]}]
set_load -pin_load 3.40189 [get_ports {DM_ADDRESS[33]}]
set_load -pin_load 3.40189 [get_ports {DM_ADDRESS[32]}]
set_load -pin_load 3.40189 [get_ports {DM_ADDRESS[31]}]
set_load -pin_load 3.40189 [get_ports {DM_ADDRESS[30]}]
set_load -pin_load 3.40189 [get_ports {DM_ADDRESS[29]}]
set_load -pin_load 3.40189 [get_ports {DM_ADDRESS[28]}]
set_load -pin_load 3.40189 [get_ports {DM_ADDRESS[27]}]
set_load -pin_load 3.40189 [get_ports {DM_ADDRESS[26]}]
set_load -pin_load 3.40189 [get_ports {DM_ADDRESS[25]}]
set_load -pin_load 3.40189 [get_ports {DM_ADDRESS[24]}]
set_load -pin_load 3.40189 [get_ports {DM_ADDRESS[23]}]
set_load -pin_load 3.40189 [get_ports {DM_ADDRESS[22]}]
set_load -pin_load 3.40189 [get_ports {DM_ADDRESS[21]}]
set_load -pin_load 3.40189 [get_ports {DM_ADDRESS[20]}]
set_load -pin_load 3.40189 [get_ports {DM_ADDRESS[19]}]
set_load -pin_load 3.40189 [get_ports {DM_ADDRESS[18]}]
set_load -pin_load 3.40189 [get_ports {DM_ADDRESS[17]}]
set_load -pin_load 3.40189 [get_ports {DM_ADDRESS[16]}]
set_load -pin_load 3.40189 [get_ports {DM_ADDRESS[15]}]
set_load -pin_load 3.40189 [get_ports {DM_ADDRESS[14]}]
set_load -pin_load 3.40189 [get_ports {DM_ADDRESS[13]}]
set_load -pin_load 3.40189 [get_ports {DM_ADDRESS[12]}]
set_load -pin_load 3.40189 [get_ports {DM_ADDRESS[11]}]
set_load -pin_load 3.40189 [get_ports {DM_ADDRESS[10]}]
set_load -pin_load 3.40189 [get_ports {DM_ADDRESS[9]}]
set_load -pin_load 3.40189 [get_ports {DM_ADDRESS[8]}]
set_load -pin_load 3.40189 [get_ports {DM_ADDRESS[7]}]
set_load -pin_load 3.40189 [get_ports {DM_ADDRESS[6]}]
set_load -pin_load 3.40189 [get_ports {DM_ADDRESS[5]}]
set_load -pin_load 3.40189 [get_ports {DM_ADDRESS[4]}]
set_load -pin_load 3.40189 [get_ports {DM_ADDRESS[3]}]
set_load -pin_load 3.40189 [get_ports {DM_ADDRESS[2]}]
set_load -pin_load 3.40189 [get_ports {DM_ADDRESS[1]}]
set_load -pin_load 3.40189 [get_ports {DM_ADDRESS[0]}]
set_load -pin_load 3.40189 [get_ports {DM_WRITE_DATA[63]}]
set_load -pin_load 3.40189 [get_ports {DM_WRITE_DATA[62]}]
set_load -pin_load 3.40189 [get_ports {DM_WRITE_DATA[61]}]
set_load -pin_load 3.40189 [get_ports {DM_WRITE_DATA[60]}]
set_load -pin_load 3.40189 [get_ports {DM_WRITE_DATA[59]}]
set_load -pin_load 3.40189 [get_ports {DM_WRITE_DATA[58]}]
set_load -pin_load 3.40189 [get_ports {DM_WRITE_DATA[57]}]
set_load -pin_load 3.40189 [get_ports {DM_WRITE_DATA[56]}]
set_load -pin_load 3.40189 [get_ports {DM_WRITE_DATA[55]}]
set_load -pin_load 3.40189 [get_ports {DM_WRITE_DATA[54]}]
set_load -pin_load 3.40189 [get_ports {DM_WRITE_DATA[53]}]
set_load -pin_load 3.40189 [get_ports {DM_WRITE_DATA[52]}]
set_load -pin_load 3.40189 [get_ports {DM_WRITE_DATA[51]}]
set_load -pin_load 3.40189 [get_ports {DM_WRITE_DATA[50]}]
set_load -pin_load 3.40189 [get_ports {DM_WRITE_DATA[49]}]
set_load -pin_load 3.40189 [get_ports {DM_WRITE_DATA[48]}]
set_load -pin_load 3.40189 [get_ports {DM_WRITE_DATA[47]}]
set_load -pin_load 3.40189 [get_ports {DM_WRITE_DATA[46]}]
set_load -pin_load 3.40189 [get_ports {DM_WRITE_DATA[45]}]
set_load -pin_load 3.40189 [get_ports {DM_WRITE_DATA[44]}]
set_load -pin_load 3.40189 [get_ports {DM_WRITE_DATA[43]}]
set_load -pin_load 3.40189 [get_ports {DM_WRITE_DATA[42]}]
set_load -pin_load 3.40189 [get_ports {DM_WRITE_DATA[41]}]
set_load -pin_load 3.40189 [get_ports {DM_WRITE_DATA[40]}]
set_load -pin_load 3.40189 [get_ports {DM_WRITE_DATA[39]}]
set_load -pin_load 3.40189 [get_ports {DM_WRITE_DATA[38]}]
set_load -pin_load 3.40189 [get_ports {DM_WRITE_DATA[37]}]
set_load -pin_load 3.40189 [get_ports {DM_WRITE_DATA[36]}]
set_load -pin_load 3.40189 [get_ports {DM_WRITE_DATA[35]}]
set_load -pin_load 3.40189 [get_ports {DM_WRITE_DATA[34]}]
set_load -pin_load 3.40189 [get_ports {DM_WRITE_DATA[33]}]
set_load -pin_load 3.40189 [get_ports {DM_WRITE_DATA[32]}]
set_load -pin_load 3.40189 [get_ports {DM_WRITE_DATA[31]}]
set_load -pin_load 3.40189 [get_ports {DM_WRITE_DATA[30]}]
set_load -pin_load 3.40189 [get_ports {DM_WRITE_DATA[29]}]
set_load -pin_load 3.40189 [get_ports {DM_WRITE_DATA[28]}]
set_load -pin_load 3.40189 [get_ports {DM_WRITE_DATA[27]}]
set_load -pin_load 3.40189 [get_ports {DM_WRITE_DATA[26]}]
set_load -pin_load 3.40189 [get_ports {DM_WRITE_DATA[25]}]
set_load -pin_load 3.40189 [get_ports {DM_WRITE_DATA[24]}]
set_load -pin_load 3.40189 [get_ports {DM_WRITE_DATA[23]}]
set_load -pin_load 3.40189 [get_ports {DM_WRITE_DATA[22]}]
set_load -pin_load 3.40189 [get_ports {DM_WRITE_DATA[21]}]
set_load -pin_load 3.40189 [get_ports {DM_WRITE_DATA[20]}]
set_load -pin_load 3.40189 [get_ports {DM_WRITE_DATA[19]}]
set_load -pin_load 3.40189 [get_ports {DM_WRITE_DATA[18]}]
set_load -pin_load 3.40189 [get_ports {DM_WRITE_DATA[17]}]
set_load -pin_load 3.40189 [get_ports {DM_WRITE_DATA[16]}]
set_load -pin_load 3.40189 [get_ports {DM_WRITE_DATA[15]}]
set_load -pin_load 3.40189 [get_ports {DM_WRITE_DATA[14]}]
set_load -pin_load 3.40189 [get_ports {DM_WRITE_DATA[13]}]
set_load -pin_load 3.40189 [get_ports {DM_WRITE_DATA[12]}]
set_load -pin_load 3.40189 [get_ports {DM_WRITE_DATA[11]}]
set_load -pin_load 3.40189 [get_ports {DM_WRITE_DATA[10]}]
set_load -pin_load 3.40189 [get_ports {DM_WRITE_DATA[9]}]
set_load -pin_load 3.40189 [get_ports {DM_WRITE_DATA[8]}]
set_load -pin_load 3.40189 [get_ports {DM_WRITE_DATA[7]}]
set_load -pin_load 3.40189 [get_ports {DM_WRITE_DATA[6]}]
set_load -pin_load 3.40189 [get_ports {DM_WRITE_DATA[5]}]
set_load -pin_load 3.40189 [get_ports {DM_WRITE_DATA[4]}]
set_load -pin_load 3.40189 [get_ports {DM_WRITE_DATA[3]}]
set_load -pin_load 3.40189 [get_ports {DM_WRITE_DATA[2]}]
set_load -pin_load 3.40189 [get_ports {DM_WRITE_DATA[1]}]
set_load -pin_load 3.40189 [get_ports {DM_WRITE_DATA[0]}]
create_clock [get_ports CLK]  -name MY_CLK  -period 8.76  -waveform {0 4.38}
set_clock_uncertainty 0.07  [get_clocks MY_CLK]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports RST_N]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {INSTRUCTION[31]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {INSTRUCTION[30]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {INSTRUCTION[29]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {INSTRUCTION[28]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {INSTRUCTION[27]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {INSTRUCTION[26]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {INSTRUCTION[25]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {INSTRUCTION[24]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {INSTRUCTION[23]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {INSTRUCTION[22]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {INSTRUCTION[21]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {INSTRUCTION[20]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {INSTRUCTION[19]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {INSTRUCTION[18]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {INSTRUCTION[17]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {INSTRUCTION[16]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {INSTRUCTION[15]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {INSTRUCTION[14]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {INSTRUCTION[13]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {INSTRUCTION[12]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {INSTRUCTION[11]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {INSTRUCTION[10]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {INSTRUCTION[9]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {INSTRUCTION[8]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {INSTRUCTION[7]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {INSTRUCTION[6]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {INSTRUCTION[5]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {INSTRUCTION[4]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {INSTRUCTION[3]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {INSTRUCTION[2]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {INSTRUCTION[1]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {INSTRUCTION[0]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DM_READ_DATA[63]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DM_READ_DATA[62]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DM_READ_DATA[61]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DM_READ_DATA[60]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DM_READ_DATA[59]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DM_READ_DATA[58]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DM_READ_DATA[57]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DM_READ_DATA[56]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DM_READ_DATA[55]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DM_READ_DATA[54]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DM_READ_DATA[53]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DM_READ_DATA[52]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DM_READ_DATA[51]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DM_READ_DATA[50]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DM_READ_DATA[49]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DM_READ_DATA[48]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DM_READ_DATA[47]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DM_READ_DATA[46]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DM_READ_DATA[45]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DM_READ_DATA[44]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DM_READ_DATA[43]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DM_READ_DATA[42]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DM_READ_DATA[41]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DM_READ_DATA[40]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DM_READ_DATA[39]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DM_READ_DATA[38]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DM_READ_DATA[37]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DM_READ_DATA[36]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DM_READ_DATA[35]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DM_READ_DATA[34]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DM_READ_DATA[33]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DM_READ_DATA[32]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DM_READ_DATA[31]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DM_READ_DATA[30]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DM_READ_DATA[29]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DM_READ_DATA[28]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DM_READ_DATA[27]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DM_READ_DATA[26]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DM_READ_DATA[25]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DM_READ_DATA[24]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DM_READ_DATA[23]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DM_READ_DATA[22]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DM_READ_DATA[21]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DM_READ_DATA[20]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DM_READ_DATA[19]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DM_READ_DATA[18]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DM_READ_DATA[17]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DM_READ_DATA[16]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DM_READ_DATA[15]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DM_READ_DATA[14]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DM_READ_DATA[13]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DM_READ_DATA[12]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DM_READ_DATA[11]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DM_READ_DATA[10]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DM_READ_DATA[9]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DM_READ_DATA[8]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DM_READ_DATA[7]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DM_READ_DATA[6]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DM_READ_DATA[5]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DM_READ_DATA[4]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DM_READ_DATA[3]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DM_READ_DATA[2]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DM_READ_DATA[1]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DM_READ_DATA[0]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {IM_ADDRESS[63]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {IM_ADDRESS[62]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {IM_ADDRESS[61]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {IM_ADDRESS[60]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {IM_ADDRESS[59]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {IM_ADDRESS[58]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {IM_ADDRESS[57]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {IM_ADDRESS[56]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {IM_ADDRESS[55]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {IM_ADDRESS[54]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {IM_ADDRESS[53]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {IM_ADDRESS[52]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {IM_ADDRESS[51]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {IM_ADDRESS[50]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {IM_ADDRESS[49]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {IM_ADDRESS[48]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {IM_ADDRESS[47]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {IM_ADDRESS[46]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {IM_ADDRESS[45]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {IM_ADDRESS[44]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {IM_ADDRESS[43]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {IM_ADDRESS[42]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {IM_ADDRESS[41]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {IM_ADDRESS[40]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {IM_ADDRESS[39]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {IM_ADDRESS[38]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {IM_ADDRESS[37]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {IM_ADDRESS[36]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {IM_ADDRESS[35]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {IM_ADDRESS[34]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {IM_ADDRESS[33]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {IM_ADDRESS[32]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {IM_ADDRESS[31]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {IM_ADDRESS[30]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {IM_ADDRESS[29]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {IM_ADDRESS[28]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {IM_ADDRESS[27]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {IM_ADDRESS[26]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {IM_ADDRESS[25]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {IM_ADDRESS[24]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {IM_ADDRESS[23]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {IM_ADDRESS[22]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {IM_ADDRESS[21]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {IM_ADDRESS[20]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {IM_ADDRESS[19]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {IM_ADDRESS[18]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {IM_ADDRESS[17]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {IM_ADDRESS[16]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {IM_ADDRESS[15]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {IM_ADDRESS[14]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {IM_ADDRESS[13]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {IM_ADDRESS[12]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {IM_ADDRESS[11]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {IM_ADDRESS[10]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {IM_ADDRESS[9]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {IM_ADDRESS[8]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {IM_ADDRESS[7]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {IM_ADDRESS[6]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {IM_ADDRESS[5]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {IM_ADDRESS[4]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {IM_ADDRESS[3]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {IM_ADDRESS[2]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {IM_ADDRESS[1]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {IM_ADDRESS[0]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports MEMWRITE_OUT]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports MEMREAD_OUT]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DM_ADDRESS[63]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DM_ADDRESS[62]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DM_ADDRESS[61]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DM_ADDRESS[60]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DM_ADDRESS[59]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DM_ADDRESS[58]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DM_ADDRESS[57]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DM_ADDRESS[56]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DM_ADDRESS[55]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DM_ADDRESS[54]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DM_ADDRESS[53]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DM_ADDRESS[52]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DM_ADDRESS[51]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DM_ADDRESS[50]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DM_ADDRESS[49]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DM_ADDRESS[48]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DM_ADDRESS[47]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DM_ADDRESS[46]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DM_ADDRESS[45]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DM_ADDRESS[44]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DM_ADDRESS[43]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DM_ADDRESS[42]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DM_ADDRESS[41]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DM_ADDRESS[40]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DM_ADDRESS[39]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DM_ADDRESS[38]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DM_ADDRESS[37]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DM_ADDRESS[36]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DM_ADDRESS[35]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DM_ADDRESS[34]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DM_ADDRESS[33]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DM_ADDRESS[32]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DM_ADDRESS[31]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DM_ADDRESS[30]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DM_ADDRESS[29]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DM_ADDRESS[28]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DM_ADDRESS[27]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DM_ADDRESS[26]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DM_ADDRESS[25]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DM_ADDRESS[24]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DM_ADDRESS[23]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DM_ADDRESS[22]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DM_ADDRESS[21]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DM_ADDRESS[20]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DM_ADDRESS[19]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DM_ADDRESS[18]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DM_ADDRESS[17]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DM_ADDRESS[16]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DM_ADDRESS[15]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DM_ADDRESS[14]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DM_ADDRESS[13]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DM_ADDRESS[12]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DM_ADDRESS[11]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DM_ADDRESS[10]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DM_ADDRESS[9]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DM_ADDRESS[8]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DM_ADDRESS[7]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DM_ADDRESS[6]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DM_ADDRESS[5]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DM_ADDRESS[4]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DM_ADDRESS[3]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DM_ADDRESS[2]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DM_ADDRESS[1]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DM_ADDRESS[0]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DM_WRITE_DATA[63]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DM_WRITE_DATA[62]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DM_WRITE_DATA[61]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DM_WRITE_DATA[60]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DM_WRITE_DATA[59]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DM_WRITE_DATA[58]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DM_WRITE_DATA[57]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DM_WRITE_DATA[56]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DM_WRITE_DATA[55]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DM_WRITE_DATA[54]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DM_WRITE_DATA[53]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DM_WRITE_DATA[52]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DM_WRITE_DATA[51]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DM_WRITE_DATA[50]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DM_WRITE_DATA[49]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DM_WRITE_DATA[48]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DM_WRITE_DATA[47]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DM_WRITE_DATA[46]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DM_WRITE_DATA[45]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DM_WRITE_DATA[44]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DM_WRITE_DATA[43]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DM_WRITE_DATA[42]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DM_WRITE_DATA[41]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DM_WRITE_DATA[40]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DM_WRITE_DATA[39]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DM_WRITE_DATA[38]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DM_WRITE_DATA[37]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DM_WRITE_DATA[36]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DM_WRITE_DATA[35]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DM_WRITE_DATA[34]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DM_WRITE_DATA[33]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DM_WRITE_DATA[32]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DM_WRITE_DATA[31]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DM_WRITE_DATA[30]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DM_WRITE_DATA[29]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DM_WRITE_DATA[28]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DM_WRITE_DATA[27]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DM_WRITE_DATA[26]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DM_WRITE_DATA[25]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DM_WRITE_DATA[24]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DM_WRITE_DATA[23]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DM_WRITE_DATA[22]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DM_WRITE_DATA[21]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DM_WRITE_DATA[20]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DM_WRITE_DATA[19]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DM_WRITE_DATA[18]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DM_WRITE_DATA[17]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DM_WRITE_DATA[16]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DM_WRITE_DATA[15]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DM_WRITE_DATA[14]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DM_WRITE_DATA[13]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DM_WRITE_DATA[12]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DM_WRITE_DATA[11]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DM_WRITE_DATA[10]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DM_WRITE_DATA[9]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DM_WRITE_DATA[8]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DM_WRITE_DATA[7]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DM_WRITE_DATA[6]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DM_WRITE_DATA[5]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DM_WRITE_DATA[4]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DM_WRITE_DATA[3]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DM_WRITE_DATA[2]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DM_WRITE_DATA[1]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DM_WRITE_DATA[0]}]
