read_verilog -netlist ../netlist/RISCV_pipeline.v
read_saif -input ../saif/RISCV_pipeline_syn.saif -instance tb_riscv/UUT -unit ns -scale 1
create_clock -name MY_CLK CLK

report_power > report_power.txt
