### READ VHDL AND ELABORATE

analyze -library WORK -format vhdl {../../src/common/ADDER.vhd ../../src/common/SUBTRACTOR.vhd ../../src/common/PC_REG.vhd ../../src/common/REG_FILE.vhd ../../src/common/ImmGen.vhd ../../src/no_abs/ALU_CONTROL.vhd ../../src/common/CONTROL.vhd ../../src/no_abs/ALU.vhd ../../src/common/DECODE.vhd ../../src/no_abs/EXECUTE.vhd ../../src/common/FETCH.vhd ../../src/common/MEM.vhd ../../src/common/WB.vhd ../../src/no_abs/RISCV_pipeline.vhd}
set power_preserve_rtl_hier_names true
elaborate RISCV_pipeline -arch STRUCT -lib WORK > elaborate.txt
uniquify
link


### APPLYING CONSTRAINTS

create_clock -name MY_CLK -period 2.14 CLK
set_dont_touch_network MY_CLK
set_clock_uncertainty 0.07 [get_clocks MY_CLK]
set_input_delay 0.5 -max -clock MY_CLK [remove_from_collection [all_inputs] CLK]
set_output_delay 0.5 -max -clock MY_CLK [all_outputs]
set OLOAD [load_of NangateOpenCellLibrary/BUF_X4/A]
set_load $OLOAD [all_outputs]


### START SYNTHESIS

compile


### REPORTS

report_timing > report_timing_2_14_ns_MET.txt
report_area > report_area_2_14_ns.txt

ungroup -all -flatten
change_names -hierarchy -rules verilog
write_sdf ../netlist/RISCV_pipeline.sdf
write -f verilog -hierarchy -output ../netlist/RISCV_pipeline.v
write_sdc ../netlist/RISCV_pipeline.sdc

### CLOSE

quit
