read_verilog -netlist ../netlist/RISCV_pipeline_abs.v
read_saif -input ../saif/RISCV_pipeline_syn_abs.saif -instance tb_riscv_abs/UUT -unit ns -scale 1
create_clock -name MY_CLK CLK

report_power > report_power.txt
